---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RoofFailures.ExtrudedRoofCutBySketch
source: html/b5793502-a8c3-298c-1b41-7c80ed213cf3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RoofFailures.ExtrudedRoofCutBySketch Property

Entire extruded Roof is cut by cut Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId ExtrudedRoofCutBySketch { get; }
```